NovaClassificados/app/Models/AdvertModel.php

SELECT *
FROM `adverts_images`
WHERE `adverts_id` = 699
---
    public function getAdvertImages(int $advertID): array
    {
        return $this->db->table('adverts_images')->where('adverts_id', $advertID)->get()->getResult();

SELECT COUNT(*) AS `numrows`
FROM (
SELECT `adverts`.*, `categories`.`name` AS `category`, `categories`.`slug` AS `category_slug`, `adverts_images`.`image` AS `images`
FROM `adverts`
JOIN `categories` ON `categories`.`id` = `adverts`.`category_id`
JOIN `adverts_images` ON `adverts_images`.`adverts_id` = `adverts`.`id`
WHERE `adverts`.`is_published` = 1
AND `adverts`.`deleted_at` IS NULL
GROUP BY `adverts`.`id`
) CI_count_all_results
SELECT `adverts`.*, `categories`.`name` AS `category`, `categories`.`slug` AS `category_slug`, `adverts_images`.`image` AS `images`
FROM `adverts`
JOIN `categories` ON `categories`.`id` = `adverts`.`category_id`
JOIN `adverts_images` ON `adverts_images`.`adverts_id` = `adverts`.`id`
WHERE `adverts`.`is_published` = 1
AND `adverts`.`deleted_at` IS NULL
GROUP BY `adverts`.`id`
ORDER BY `adverts`.`id` DESC
 LIMIT 6, 6
---
    public function getAllAdvertsPaginated(int $perPage = 10, array $criteria = [])
    {
        $this->setSQLMode();

        $builder = $this;

        $tableFields = [

            'adverts.*',
            'categories.name AS category',
            'categories.slug AS category_slug',
            'adverts_images.image AS images', // para utilizarmos no metodo image do entity advert

        ];

        $builder->select($tableFields);
        $builder->join('categories', 'categories.id = adverts.category_id');
        $builder->join('adverts_images', 'adverts_images.adverts_id = adverts.id');

        if (!empty($criteria)) {
            $builder->where($criteria);
        }

        $builder->where('adverts.is_published',true);
        $builder->orderBy('adverts.id','DESC');
        $builder->groupBy('adverts.id');

        $adverts = $builder->paginate($perPage);

SELECT `adverts`.*, `users`.`name`, `users`.`email`, `users`.`username`, `users`.`phone`, `users`.`display_phone`, `users`.`created_at` AS `user_since`, `categories`.`name` AS `category`, `categories`.`slug` AS `category_slug`
FROM `adverts`
JOIN `users` ON `users`.`id` = `adverts`.`user_id`
JOIN `categories` ON `categories`.`id` = `adverts`.`category_id`
WHERE `adverts`.`is_published` = 1
AND `adverts`.`code` = 'ADVERT_63024FE0C797A4.75042435'
AND `adverts`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getAdvertByCode(string $code, bool $offTheLoggedInUser = false) // crian na classe de serviço
    {
        $tableFields =[
            'adverts.*',
            'users.name',
            'users.email', /// usaremos para a parte de perguntas
            'users.username',
            'users.phone',
            'users.display_phone',
            'users.created_at AS user_since',
            'categories.name AS category',
            'categories.slug AS category_slug', // usaremos para filtrar os anuncios por categorias

        ];

        $builder = $this;
        $builder->select($tableFields);
        $builder->join('users', 'users.id = adverts.user_id');
        $builder->join('categories', 'categories.id = adverts.category_id');
        $builder->where('adverts.is_published',true);
        $builder->where('adverts.code',$code);


        if($offTheLoggedInUser){

            $builder->where('adverts.user_id', $this->user->id);

        }

        $advert=$builder->first();

SELECT `adverts_id`
FROM `adverts_images`
SELECT `adverts`.*, `categories`.`name` AS `category`, COUNT(adverts.id) AS total_adverts
FROM `adverts`
JOIN `categories` ON `categories`.`id` = `adverts`.`category_id`
WHERE `adverts`.`is_published` = 1
AND `categories`.`slug` = 'camisas'
AND `adverts`.`id` IN ('222','290','290','359','359','359','375','375','375','398','398','398','398','699','699','699','699','743','860','902','902','902','902','966','967','967','967','967','968','969','969')
AND `adverts`.`deleted_at` IS NULL
GROUP BY `adverts`.`city`
ORDER BY `total_adverts` DESC
 LIMIT 5
---
    public function getCitiesFromPublishedAdverts(int $limit = 5, string $categorySlug = null):array{

        $this->setSQLMode();

        $tableFields = [
            'adverts.*',
            'categories.name AS category', // para debug
            'COUNT(adverts.id) AS total_adverts'
        ];

        //recupero apenas os adverts_id da tabela de images
        $advertsIDS = array_column($this->db->table('adverts_images')->select('adverts_id')->get()->getResultArray(),'adverts_id');

        $builder = $this;

        $builder->select($tableFields);
        //$builder->asArray(); //para debug

        $builder->join('categories','categories.id = adverts.category_id');
        $builder->where('adverts.is_published', true);
        $builder->where('categories.slug',$categorySlug);
        $builder->whereIn('adverts.id',$advertsIDS); // apenas em anuncios que possui imagens
        $builder->groupBy('adverts.city');
        $builder->orderBy('total_adverts','DESC');

        return $builder->findAll($limit);

SELECT *
FROM `adverts_questions`
WHERE `advert_id` = 699
ORDER BY `id` DESC
---
public function getAdvertQuestions(int $advertID):array
{

    $builder = $this->db->table('adverts_questions');
    $builder->where('advert_id',$advertID);
    $builder->orderBy('id','DESC');
    return  $builder->get()->getResult();