NovaClassificados/app/Models/CategoryModel.php

    public function getCategoriesFromPublishedAdverts(int $limit = 5): array
    {
        $this->setSQLMode();

        $tableFields = [
            'categories.*',
            'COUNT(adverts.id) AS total_adverts'
        ];

        //recupero apenas os adverts_id da tabela de images
        $advertsIDS = array_column($this->db->table('adverts_images')->select('adverts_id')->get()->getResultArray(),'adverts_id');

        $builder = $this;

        $builder->select($tableFields);
        $builder->asObject();
        //$builder->asArray();
        $builder->join('adverts','adverts.category_id = categories.id');
        $builder->where('adverts.is_published', true);

        // quero garantir que apenas anuncios com imagens seja contabilizados.
        if(!empty($advertsIDS)){

           $builder->whereIn('adverts.id',$advertsIDS);

           $builder->groupBy('categories.name');
           $builder->orderBy('total_adverts','DESC');

           return $builder->findAll($limit);
---
SELECT `adverts_id`
FROM `adverts_images`
SELECT `categories`.*, COUNT(adverts.id) AS total_adverts
FROM `categories`
JOIN `adverts` ON `adverts`.`category_id` = `categories`.`id`
WHERE `adverts`.`is_published` = 1
AND `adverts`.`id` IN ('222','290','290','359','359','359','375','375','375','398','398','398','398','699','699','699','699','743','860','902','902','902','902','966','967','967','967','967','968','969','969')
AND `categories`.`deleted_at` IS NULL
GROUP BY `categories`.`name`
ORDER BY `total_adverts` DESC
 LIMIT 10