NovaClassificados/app/Services/CategoryService.php

SELECT *
FROM `categories`
WHERE `slug` = 'camisas'
AND `categories`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getCategoryBySlug(string $categorySlug, bool $withDeleted = false)
    {
        $category = $this->categoryModel->withDeleted($withDeleted)->where('slug', $categorySlug)->first();