NovaClassificados/app/Controllers/Manager/CategoriesController.php

SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
ORDER BY `id` DESC
---
    public function getAllCategories()
    {
        if(!$this->request->isAJAX()){

            return redirect()->back();
        }

        $categoryModel = new CategoryModel();

       // exit('categoria.get.all');

       $categories = $categoryModel->asObject()->orderBy('id','DESC')->findAll();